import styles from './Board.module.css'
import BoardListItem from './BoardListItem'

export type Article = {
  category: string
  title: string
  content: string
  author: string
  datetime: Date
  hit: number
}
const columns = {
  category: '분류',
  title: '제목',
  // content: '내용',
  author: '작성자',
  datetime: '작성일',
  hit: '조회수',
}
const articles: Article[] = [
  {
    category: '일반',
    title: `제목11111111111111111111111111111111111111111111111111111111111111111111111111
  111111111111111111111111111111111111111111111111111111111111111111111111`,
    content: `내용11111111111111111111111111111111111111111111111111111111
  11111111111111111111111111111111111111111111111111111111111111111111111
  11111111111111111111111111111111111111111111111111111111111111111111111`,
    author: '이병건11111111',
    datetime: new Date(new Date().getTime() - 1000 * 10), // 10초 전
    hit: 1033333,
  },
  {
    category: '일반',
    title: '제목2222222222222222222222222222222222222222222222222222222222222222222222222222222',
    content: `내용22222222222222222222222222222222222222222222222222222222222222222222222
  22222222222222222222222222222222222222222222222222222222222222222222222`,
    author: '이병건222222222',
    datetime: new Date(new Date().getTime() - 1000 * 60 * 10), // 10분 전
    hit: 100,
  },
  {
    category: '토론',
    title: '제목333333333333333333333333333333333333333333333333333333333333333333333333333333333',
    content: `내용33333333333333333333333333333333333333333333333333333333333333333333333
    3333333333333333333333333333333333333333333333333333333333333333333333
    333333333333333333333333333333333333333333333333333333333333333333333333`,
    author: '이병건333333',
    datetime: new Date(new Date().getTime() - 1000 * 60 * 60 * 2), // 2시간 전
    hit: 10,
  },
  {
    category: '토론',
    title: '제목333333333333333333333333333333333333333333333333333333333333333333333333333333333',
    content: `내용33333333333333333333333333333333333333333333333333333333333333333333333
    3333333333333333333333333333333333333333333333333333333333333333333333
    333333333333333333333333333333333333333333333333333333333333333333333333`,
    author: '이병건',
    datetime: new Date(new Date().getTime() - 1000 * 60 * 60 * 24), // 하루 전
    hit: 10,
  },
]
export default function Board() {
  return (
    <>
      <div className={styles.board}>
        <div className={styles.tableWrapper}>
          <table>
            <thead>
              <tr>
                {Object.entries(columns).map(([name, value]) => (
                  <th data-role={name}>{value}</th>
                ))}
              </tr>
            </thead>
            <tbody>
              {articles.map((article) => (
                <BoardListItem {...article} />
              ))}
            </tbody>
          </table>
        </div>
      </div>
    </>
  )
}
